package taskFromEugene6;

/*6.
Определить класс, хранящий такую информацию о пользователе библиотеки: ФИО, номер читательского билета, факультет, 
дата рождения, телефон. Доступ к данным класса организовать посредством соответствующих методов. Разработать программу, 
в которой создается массив объектов данного класса. В программе организовать:
– ввод данных о читателях;
– вывод данных массива на экран;
– поиск (по фамилии или факультету) и вывод информации о читателях*/

public class UserLibrary {

	
}
