package taskFromEugene9;

public class Main {
	/*
	 * 9. Ассоциативный массив представляет собой набор пар Ключ-Значение. Все
	 * ключи в таком наборе уникальны. Доступ к элементам-значениям производится
	 * по ключу. Если сравнивать с обычным массивом, то в обычном массиве ключом
	 * является индекс. Тут - ключем может быть любое значение заданного типа.
	 * Ограничение - типы Ключей и типы Значений в пределах ассоциативного
	 * массива одинаковы. Например: Ключи - String, Значения - Student[]. Смысл
	 * такого набора - ключ это название группы, значение - массив студентов
	 * этой группы. Реализовать такой массив и создать для него CRUD операции.
	 * При добавлении элемента в такой массив нужно указывать ключ и значение.
	 */
	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
